
 
#+title: Emacs From Scratch Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-
#+end_src

*** OCaml
#+BEGIN_SRC emacs-lisp
   (use-package auto-complete
       :ensure t
       :config
       (setq ac-use-menu-map t)
       (setq ac-ignore-case nil)
       (define-key ac-menu-map "\C-n" 'ac-next)
       (define-key ac-menu-map "\C-p" 'ac-previous))


  (use-package utop
  :ensure t)

  (use-package merlin
  :ensure t)

   (use-package  tuareg
      :ensure t)

  (use-package ocp-indent
      :ensure t)


  (add-hook 'tuareg-mode-hook 'tuareg-imenu-set-imenu)
  (setq auto-mode-alist
        (append '(("\\.ml[ily]?$" . tuareg-mode)
                  ("\\.topml$" . tuareg-mode))
                auto-mode-alist))
  ;;(autoload 'utop-setup-ocaml-buffer "utop" "Toplevel for OCaml" t)
  (autoload 'utop-minor-mode "utop" "Toplevel for OCaml" t)
  (add-hook 'tuareg-mode-hook 'utop-setup-ocaml-buffer)
  (add-hook 'tuareg-mode-hook 'merlin-mode)
  (setq merlin-use-auto-complete-mode t)
  (setq merlin-error-after-save nil)

  ;; -- merlin setup ---------------------------------------

  (setq opam-share (substring (shell-command-to-string "opam config var share") 0 -1))
  (add-to-list 'load-path (concat opam-share "/emacs/site-lisp"))
  (require 'merlin)

  ;; Enable Merlin for ML buffers
  (add-hook 'tuareg-mode-hook 'merlin-mode)
  (add-hook 'merlin-mode-hook 'company-mode)

  ;; So you can do it on a mac, where `C-<up>` and `C-<down>` are used
  ;; by spaces.
  (define-key merlin-mode-map
    (kbd "C-c <up>") 'merlin-type-enclosing-go-up)
  (define-key merlin-mode-map
    (kbd "C-c <down>") 'merlin-type-enclosing-go-down)
  (set-face-background 'merlin-type-face "#88FF44")

  ;; -- enable auto-complete -------------------------------
  ;; Not required, but useful along with merlin-mode
  (require 'auto-complete)
  (add-hook 'tuareg-mode-hook 'auto-complete-mode)

  (add-to-list 'load-path "/home/mihshe/.opam/4.10.0/share/emacs/site-lisp")
  (require 'ocp-indent)



#+END_SRC
#+RESULTS:
| auto-complete-mode | merlin-mode | utop-setup-ocaml-buffer | tuareg-imenu-set-imenu |

